п»ї// pch.h: СЌС‚Рѕ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕ СЃРєРѕРјРїРёР»РёСЂРѕРІР°РЅРЅС‹Р№ Р·Р°РіРѕР»РѕРІРѕС‡РЅС‹Р№ С„Р°Р№Р».
// РџРµСЂРµС‡РёСЃР»РµРЅРЅС‹Рµ РЅРёР¶Рµ С„Р°Р№Р»С‹ РєРѕРјРїРёР»РёСЂСѓСЋС‚СЃСЏ С‚РѕР»СЊРєРѕ РѕРґРёРЅ СЂР°Р·, С‡С‚Рѕ СѓСЃРєРѕСЂСЏРµС‚ РїРѕСЃР»РµРґСѓСЋС‰РёРµ СЃР±РѕСЂРєРё.
// Р­С‚Рѕ С‚Р°РєР¶Рµ РІР»РёСЏРµС‚ РЅР° СЂР°Р±РѕС‚Сѓ IntelliSense, РІРєР»СЋС‡Р°СЏ РјРЅРѕРіРёРµ С„СѓРЅРєС†РёРё РїСЂРѕСЃРјРѕС‚СЂР° Рё Р·Р°РІРµСЂС€РµРЅРёСЏ РєРѕРґР°.
// РћРґРЅР°РєРѕ РёР·РјРµРЅРµРЅРёРµ Р»СЋР±РѕРіРѕ РёР· РїСЂРёРІРµРґРµРЅРЅС‹С… Р·РґРµСЃСЊ С„Р°Р№Р»РѕРІ РјРµР¶РґСѓ РѕРїРµСЂР°С†РёСЏРјРё СЃР±РѕСЂРєРё РїСЂРёРІРµРґРµС‚ Рє РїРѕРІС‚РѕСЂРЅРѕР№ РєРѕРјРїРёР»СЏС†РёРё РІСЃРµС…(!) СЌС‚РёС… С„Р°Р№Р»РѕРІ.
// РќРµ РґРѕР±Р°РІР»СЏР№С‚Рµ СЃСЋРґР° С„Р°Р№Р»С‹, РєРѕС‚РѕСЂС‹Рµ РїР»Р°РЅРёСЂСѓРµС‚Рµ С‡Р°СЃС‚Рѕ РёР·РјРµРЅСЏС‚СЊ, С‚Р°Рє РєР°Рє РІ СЌС‚РѕРј СЃР»СѓС‡Р°Рµ РІС‹РёРіСЂС‹С€Р° РІ РїСЂРѕРёР·РІРѕРґРёС‚РµР»СЊРЅРѕСЃС‚Рё РЅРµ Р±СѓРґРµС‚.

#ifndef PCH_H
#define PCH_H

#include <cfloat>
// Р”РѕР±Р°РІСЊС‚Рµ СЃСЋРґР° Р·Р°РіРѕР»РѕРІРѕС‡РЅС‹Рµ С„Р°Р№Р»С‹ РґР»СЏ РїСЂРµРґРІР°СЂРёС‚РµР»СЊРЅРѕР№ РєРѕРјРїРёР»СЏС†РёРё

#endif //PCH_H
